app/controllers/fixtures_controller.rb

SELECT "fixtures".* FROM "fixtures" ORDER BY "fixtures"."date" DESC
---
	def index
		@fixtures = Fixture.all.order(date: :desc)

SELECT "teams".* FROM "teams" ORDER BY "teams"."city" ASC
---
	def new
		@fixture = Fixture.new
		i=1
		@stages =[]

		while i<=38
			@stages << i
			i=i+1
		end

		teams_for_array = Team.all.order(city: :asc)
		@teams = teams_for_array.map do |d|

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "fixtures" ("status", "date", "time", "home_team_id", "away_team_id", "stage", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		date = params[:fixture][:date]
		time = params[:fixture][:time]

		case
		when Date.parse(date) < Date.today
			status = "played"
		when Date.parse(date) > Date.today
			status = "scheduled"
		else #today's date
			if (time.to_time - Time.now).abs < 11400
				status = "played"
			else
				status = "scheduled"
			end
		end

		home_t = Team.find(params[:home_team].to_i)
		away_t = Team.find(params[:away_team].to_i)
		stage = params[:stage]
		Fixture.create(date:date,time:time,home_team:home_t,away_team:away_t,status:status,stage:stage)

SELECT  "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
	def show
		@fixture = Fixture.find(params[:id])

SELECT "fixtures".* FROM "fixtures" WHERE (DATE(date) <= '2020-01-22') AND "fixtures"."completed" IS NULL ORDER BY "fixtures"."date" ASC
---
	def tocomplete
		# /!\ This query has to be improved taking "time" into account!
		@fixturetocomplete = Fixture.where("DATE(date) <= ?", Date.today).where(completed:nil).order(date: :asc)

SELECT  "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
	def edit
		@fixture = Fixture.find(params[:id])

SELECT  "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "fixtures" SET "completed" = $1, "status" = $2, "scorehome" = $3, "scoreaway" = $4, "updated_at" = $5 WHERE "fixtures"."id" = $6  [["completed", true], ["status", "played"], ["scorehome", 0], ["scoreaway", 0], ["updated_at", "2020-01-25 22:21:21.606287"], ["id", 23]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "ranks".* FROM "ranks" WHERE "ranks"."team_id" = $1 ORDER BY "ranks"."id" DESC LIMIT $2  [["team_id", 5], ["LIMIT", 1]]
SELECT  "ranks".* FROM "ranks" WHERE "ranks"."team_id" = $1 ORDER BY "ranks"."id" DESC LIMIT $2  [["team_id", 9], ["LIMIT", 1]]
INSERT INTO "ranks" ("fixture_id", "team_id", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["fixture_id", 11], ["team_id", 5], ["level", 2000.0], ["created_at", "2020-01-25 22:09:42.916862"], ["updated_at", "2020-01-25 22:09:42.916862"]]
INSERT INTO "ranks" ("fixture_id", "team_id", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["fixture_id", 11], ["team_id", 9], ["level", 2000.0], ["created_at", "2020-01-25 22:09:42.978982"], ["updated_at", "2020-01-25 22:09:42.978982"]]
---
	def update
		################
		# Fixture update
		################
		@fixturetoupdate = Fixture.find(params[:id])
		@fixturetoupdate.completed = true
		@fixturetoupdate.status = "played" # /!\ Should be removed when status auto updated by CRON task
		@fixturetoupdate.update(fixture_params)
		################
		# Ranking update
		################
		homerank = Rank.where(team:@fixturetoupdate.home_team).last.level
		awayrank = Rank.where(team:@fixturetoupdate.away_team).last.level
		homescore = params[:fixture][:scorehome]
		awayscore = params[:fixture][:scoreaway]
		# ---- Home team
		newhomerank = rank_calculation(homerank,
			k_factor(homerank),
			game_result(homescore,awayscore),
			win_rate(homerank,awayrank))
		Rank.create(fixture:@fixturetoupdate,team:@fixturetoupdate.home_team,level:newhomerank)
		# ---- Away team
		newawayrank = rank_calculation(awayrank,
			k_factor(awayrank),
			game_result(awayscore,homescore),
			win_rate(awayrank,homerank))
		Rank.create(fixture:@fixturetoupdate,team:@fixturetoupdate.away_team,level:newawayrank)