app/controllers/fixtures_controller.rb

	def create
		date = params[:fixture][:date]
		time = params[:fixture][:time]
		home_t = Team.find(params[:home_team].to_i)
		away_t = Team.find(params[:away_team].to_i)
		Fixture.create(date:date,time:time,home_team:home_t,away_team:away_t)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "fixtures" ("date", "time", "home_team_id", "away_team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2020-01-01"], ["time", "21:00:00"], ["home_team_id", 5], ["away_team_id", 7], ["created_at", "2020-01-21 14:31:24.551534"], ["updated_at", "2020-01-21 14:31:24.551534"]]

	def show
		@fixture = Fixture.find(params[:id])
---
SELECT  "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

	def edit
		@fixture = Fixture.find(params[:id])
---
SELECT  "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

	def update
		@fixturetoupdate = Fixture.find(params[:id])
		@fixturetoupdate.completed = true
		@fixturetoupdate.update(fixture_params)
---
UPDATE "fixtures" SET "completed" = $1, "scorehome" = $2, "scoreaway" = $3, "updated_at" = $4 WHERE "fixtures"."id" = $5  [["completed", true], ["scorehome", 0], ["scoreaway", 32], ["updated_at", "2020-01-20 19:40:17.432398"], ["id", 15]]