app/controllers/ranks_controller.rb

	def index
		@ranks = Rank.all

		ranking = []
		teams = Team.all
		teams.each do |targetteam|
			tempteam = []
			theteam = Rank.where(team:targetteam).last
			tempteam << theteam.team.name
			tempteam << theteam.level
			ranking << tempteam
---
SELECT "ranks".* FROM "ranks"
SELECT "teams".* FROM "teams"
SELECT  "ranks".* FROM "ranks" WHERE "ranks"."team_id" = $1 ORDER BY "ranks"."id" DESC LIMIT $2  [["team_id", 1], ["LIMIT", 1]]
INSERT INTO "ranks" ("team_id", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["team_id", 1], ["level", 2000.0], ["created_at", "2020-01-25 17:17:58.904741"], ["updated_at", "2020-01-25 17:17:58.904741"]]

	def initializeranking
		teams = Team.all.order(level: :desc)
		defaultlevel = 2000
		teams.each { |team| Rank.create(team:team,level:defaultlevel) }
---
INSERT INTO "ranks" ("team_id", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["team_id", 1], ["level", 2000.0], ["created_at", "2020-01-25 17:16:16.774450"], ["updated_at", "2020-01-25 17:16:16.774450"]]
SELECT "teams".* FROM "teams"