app/controllers/teams_controller.rb

	def index
		@teams = Team.all
---
SELECT "teams".* FROM "teams"

	def create
		Team.create(team_params)
---
INSERT INTO "teams" ("name", "acronym", "city", "light_color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Paris Saint-Germain"], ["acronym", "PSG"], ["city", "Paris"], ["light_color", "#004889"], ["created_at", "2020-01-16 16:48:28.064424"], ["updated_at", "2020-01-16 16:48:28.064424"]]